[
    {
        "id": "0002",
        "title": "Travels in Hawaii and Japan, and a look into what's next",
        "date": "08/03/2024",
        "pinned": false,
        "content":[
            {
                "type": "text",
                "text":"Long time, no see! It's Jonah (Surprise!) I've just returned to Texas a few days ago after a little over 5 weeks away, and wow what a time I've had. Scuba diving, climbing mountains, and exploring new cities with old friends and new - it's truly been the time of my life. More about both adventures below!"
            },
            {
                "type": "text",
                "text": "To begin, a week in Hawaii with my family. At this point in time I was in desperate need of getting out of the house. Two weeks of scuba training in the rear view and I was ready to get on the road. I admittedly went into this part of my trip with far too low expectations. I was thinking of it as a pit stop on my way to Japan. I had always sort of viewed Hawai'i as a spot for beach vacations and not much else, but the island of Kauai proved me so wrong. To start, I got to go scuba diving with my brother and my dad, an experience I'll cherish for the rest of my life. Swimming down low with the eels, turtles, fish, and my family was surreal. I just had a blast the whole time I was on the island. While we didn't get to do the Kalalau trail, we did some other amazing hikes and some beautiful seaside biking. The boat ride up the Na Pali coast was also unforgettable. For only a week, this trip was such a joy filled time that I'm so grateful I got to share with my family before heading off to Tokyo on my own."
            },
            {
                "type": "text",
                "text": "As this was my first time overseas as an adult, and my first vacation on my own, this trip was bound to be special to me - but Japan was, to be cliche, the trip of a lifetime for me. There are few things in my life thus far that have felt so significant to me. This trip was a pilgrimage not just for me, but for 6 year old me, sitting under the covers after dark, attempting to force feed my level 70 Charizard down the throats of the Elite Four in Pokemon Fire Red. For all the versions of me that I've been since that day. The ones who found love for language, ramen, manga, music, adventure, culture, and more. I've quenched an age old thirst of mine, but also birthed new ones. I've only grown more excited to go on more journeys and learn and grow as much as I can. Dramatic words aside, I've truly done things in this past month that I've dreamt of for my entire life, and other things beyond those dreams. I'd be a fool to try to recount half of what I've enjoyed in this single blog post, but hopefully my words and the photos below can give you an idea. "
            },
            {
                "type": "text",
                "text": "Throughout my time in Japan I had so many moments that made me go, \"Am I really here? Is this really happening?\" Am I really in Japan right now? Am I really at a sumo tournament? Did I really just share a lovely cup of tea and a (very) broken conversation with a kind stranger in Japanese? Am I really at the top of Mount Fuji watching the sun rise over the Kanto region? The list goes on. I visited so many cities, and met wonderful people, some in passing, and others who I hope to stay close to for a long time to come. Without writing a book, I'm going to list just a handful of some of my great joys totally out of context from my trip. Enjoy! The beautiful garden of Guesthouse Toco, Meeting up with Taka and staying out all night at Karaoke in Shibuya, Pokemon Cafe, The gorgeous Meiji Shrine, Fukuzumiro Ryokan in Hakone, The beautiful view from the top of Fuji San and my lovely spontaneous hiking buddies, a day off in Kyoto with Ruby, the lovely old woman who offered me tea and a book of her father's poems in her craftshop, beautiful ukiyo-e museums, secondhand shopping at book-off and retro game stores, The Pax Hostel and all it's inhabitants, jazz clubs, a relaxed day in Osaka with Spencer, Ghibli Park and it's magic, the Sumo tournament, omakase from the local izakaya, the beauty of Kamikochi, the grueling yet rewarding peak of Yarigatake, the lovely nature days with Paige, the onsen at the bottom of the mountain, the harrowing yet hopeful hiroshima, learning to make gyoza, the ghibli museum, Tokyo, Hakone, Osaka, Nara, Hiroshima, Kyoto, Kamikochi, Miyajima, Kawaguchiko, Nagoya, the pokemon centers, the nintendo stores, the unmatched beauty of all of the shrines and parks I visited, the goshuin I recorded in my goshuin-cho, the lovely and helpful strangers i met, the new friends I've made, the memories I will keep and forever cherish."
            },
            {
                "type": "text",
                "text": "皆さんありがとうございます！"
            },
            {
                "type": "text",
                "text": "I now sit at home, fulfilled, and ready to look ahead. I start my new job at Amazon in San Francisco in just two weeks. I'm quite excited, and just a little nervous. I plan to spend the next two weeks enjoying all the time that I can with my family, and hopefully seeing a few friends while I remain in town. I've already packed just about everything up, and while it feels weird to finally have my childhood room completely cleared out, it feels like the right time. I'm excited to take tokens from this part of my life into the next. I've already been doing a lot of brewing in my head as to how I'll design and curate my space, and I can't wait to really get my hands on it and make it my home. I'm also eager to start working, and paving a life of my own out in the bay. Even though I'm sure things will be different than how it was for me as an intern last year, I'm confident I will find my place there. My goals for my first few months are to push myself to work hard all the time at my job, while not losing sight of the things that are important to me. I want to keep pursuing Japanese with fervor, stay close to my friends, and pursue more creative projects (I've recently been challenged to try my hand at a leather wallet so I guess that's next). I'll be sure to leave an update soon. Peace <3"
            }
        
        ]
    },
    {
        "id": "0001",
        "title": "The first post, updates, and what this is all for",
        "date": "05/26/2024",
        "pinned": true,
        "content":[
            {
                "type": "text",
                "text":"Hello! This is my first post on this blog of mine. I'm hoping to use this as kind of a space to leave updates on my life, projects, career stuff - really whatever. I think I've been feeling pretty disillusioned with social media over the last year, but I still love having a place to organize my thoughts and put them out there for anyone that might want to see what I'm up to. Now yes, I could use Instagram or Twitter or something, but this feels a lot less performative and more safe. If you're reading this - you had to actually want to come to this page, it didn't just get plopped into your endless feed. So, from here on out, I'll be posting here whenever I like. Each post will hopefully have a little bit of updates and some photos, but I'm not going to be strict on myself. Whatever comes, will come."
            },
            {
                "type": "text",
                "text": "Anyway, What ~has~ been going on? Well to start, I've just graduated! I earned my BSE in Computer Science from the University of Michigan just a few weeks ago. I had such an amazing senior year (photos of which you can find below), and I accomplished so much. You can read about my creative endeavors through this medium article I wrote for Shift. "
            },
            {
                "type": "link",
                "text": "Read the article here",
                "url": "https://medium.com/@jableman_44799/a-fond-farewell-to-home-a891967af273"
            },
            {
                "type": "text",
                "text": "So yeah, I'm really stoked on those projects - especially having made a real gameboy game. Way cool. Now, looking forward, I'm starting as a full time SDE at Amazon in August. I'll be moving out to San Francisco and couldn't be more excited. I'm so grateful to be in a city that is high proximity to so much natural beauty. Before all that though, I've got some time at home with family followed by a week in Hawaii where I'll be scuba diving, which will subsequently be followed by a month solo in Japan. I have always wanted to go to Japan, so be sure to keep an eye out for an absurdly long post about that. Anyway I think that's kind of it for now, but I'll write more soon. Photos below! Peace <3"
            }
        
        ]
    }
]