[
    {
        "projects": [
            {
                "id": "SDK",
                "title": "Sidekick",
                "date": "October - December 2023",
                "description": [
                    {
                        "type": "text",
                        "content": "Sidekick is a 3D puzzle game built in Unity with C# over the course of 2 months with my capstone project team including myself, Zach, Aaron, and Jeremy. I was involved in gameplay programming and level design, and I had full responsibility for the cutscenes and set pieces. Special thanks to my friend Ben Golden for writing the soundtrack! You can play through the game on my itch page below"
                    },
                    {
                        "type": "link",
                        "content": "Itch Portfolio",
                        "link": "https://jableman.itch.io/"
                    }
                ],

                "videoSrc": "https://www.youtube.com/embed/fAbD3sZS9Og"
            },
            {
                "id": "TWN",
                "title": "TwinHeart Prototype",
                "date": "October 2023",
                "description": [
                    {
                        "type": "text",
                        "content": "This project was a two week rapid prototype, in which I created a rhythm based platformer with variable tempo. This was a great opportunity for me to practice responding to construcitve feedback, iterative design, using the 'pub/sub' architechture patten, and enhance my level design skills. You can play through the prototype on my itch page below"
                    },
                    {
                        "type": "link",
                        "content": "Itch Portfolio",
                        "link": "https://jableman.itch.io/"
                    }
                ],
                "imageSrc": "twinheart"
            },
            {
                "id": "ZEL",
                "title": "Zelda NES Remake",
                "date": "September 2023",
                "description": [
                    {
                        "type": "text",
                        "content": "Tasked with recreating the first dungeon of Zelda for the NES in Unity, I spent 3 weeks working with a partner on this project for my Game Design class. This was a great opportunity for me to practice my level design skills, and I'm quite proud of the results! My partner and I split work evenly between us. You can play through the first dungeon, or our custom level with a new mechanic on my itch page below"
                    },
                    {
                        "type": "link",
                        "content": "Itch Portfolio",
                        "link": "https://jableman.itch.io/"
                    }
                ],
                "imageSrc": "zelda"
            },
            {
                "id": "BBB",
                "title": "BBB Lab Simulator VR",
                "date": "January - February 2023",
                "description": [
                    {
                        "type": "text",
                        "content": "Over a three-week period, I dedicatedly recreated a physical space in virtual reality using Unreal Engine 4, developed reusable components and an affordance system utilizing polymorphism for efficient development, and implemented a custom pokemon minigame"
                    }
                ],
                "videoSrc": "https://www.youtube.com/embed/Vl-r5Yk-pVo"
            },
            {
                "id": "PKN",
                "title": "Pokemon Spotify Web App",
                "description": [
                    {
                        "type": "text",
                        "content": "Pokefy is a Spotify webapp made in React with Javascript and the Spotify API. It analyzes a user's top 50 songs and returns a correspondingly popular Pokemon based on an internet poll. This was a really fun and quick project for me, as it was my first time working with a public API, and it was a challenge to get everything running and deployed in 24 hours."
                    }
                ],
                "imageSrc": "pokefy"
            }
        ]
    },
    {
        "projects": [
            {
                "id": "CNT",
                "title": "C-Note",
                "date": "March - April 2023",
                "description": [
                    {
                        "type": "text",
                        "content": "C-Note is an augmented reality app that sets out to be an educational tool to help youths learn the basics of sound synthesis and how it plays into music composition. This was built in C# using Unity's ARFoundation over the course of a month with my capstone project team including myself, Ken, Zach, Jasmine, and Hosni. For this project, I was in charge of creating the puzzle piece interactions and associated classes, visuals/animations, and design of the physical puzzle pieces. You can read more about it below"
                    },
                    {
                        "type": "link",
                        "content": "C-Note Website",
                        "link": "https://piyawatm.wixsite.com/c-note"
                    }
                ],
                "videoSrc": "https://www.youtube.com/embed/ISGjMeqMMFM"
            },
            {
                "id": "SSV",
                "title": "Stutter Speak VR",
                "date": "May - August 2021",
                "description": [
                    {
                        "type": "text",
                        "content": "I developed a VR application in Unreal Engine 4 to aid people who stutter in public speaking, incorporating object-oriented coding in C++ and Blueprint, and launched it on the Oculus store in August 2021. My commitment involved 40 hours per week on coding, design, testing, and collaboration, including bi-weekly consultations with speech pathologist Tricia Krauss-Lehrman to refine the app's vision, and building systems to manage user data, track progress, provide feedback, process custom files, and handle physics interactions."
                    },
                    {
                        "type": "link",
                        "content": "Stutter Speak VR Website",
                        "link": "https://stutterspeak.weebly.com/"
                    }
                ],
                "videoSrc": "https://www.youtube.com/embed/c-45ivGvhIM"
            },
            {
                "id": "RHY",
                "title": "VR Rhythm Game [WIP]",
                "date": "January 2024 - Present",
                "description": [
                    {
                        "type": "text",
                        "content": "Creating a rhythm game in unity to target quest VR devices. This project is early stage, currently working on the core gameplay loop and prototyping."
                    }
                ],
                "imageSrc": "RhythmVR"
            },
            {
                "id": "ANI",
                "title": "Animation",
                "description": [
                    {
                        "type": "text",
                        "content": "This was a very fun project for me. Using Adobe's animation studio, I painstakingly drew over 50 frames for this 4 second animation. I also challenged myself to design, print, and bind a physical flipbook."
                    },
                    {
                        "type": "image",
                        "content": "skate"
                    }
                ],
                "imageSrc": "flipbook"
            },
            {
                "id": "CRC",
                "title": "Crochet Projects",
                "description": [
                    {
                        "type": "image",
                        "content": "crochet1"
                    },
                    {
                        "type": "image",
                        "content": "crochet2"
                    },
                    {
                        "type": "image",
                        "content": "crochet3"
                    },
                    {
                        "type": "image",
                        "content": "crochet5"
                    },
                    {
                        "type": "text",
                        "content": "I started learning how to crochet near the end of summer 2022. It's been such a great way for me to engage with my creative side and play around with my 3d awareness. Above are a few of my favorite projects so far!"
                    }
                ],
                "imageSrc": "crochet4"
            },
            {
                "id": "RNG",
                "title": "Upcycled Rings",
                "description": [
                    {
                        "type": "text",
                        "content": "Creating these rings came from being inspired to reduce my own personal waste. As someone who skateboards, I often find myself throwing out lots of old broken decks. I wanted to challenge myself to take those and turn them into something new. While this was my first time working closely with wood, I'm quite proud of the results."
                    }
                ],
                "imageSrc": "rings"
            }
        ]
    },
    {
        "projects": [
            {
                "id": "KGP",
                "title": "Skateboard Street iOS",
                "date": "February - April 2023",
                "description": [
                    {
                        "type": "text",
                        "content": "One of my favorite projects this year, this game is a 3D skateboarding game made in Unity for iOS, and is effectively Subway Surfers - but with a twist! You can do awesome skate tricks B) You can try it out below but fair warning: it isn't that easy"
                    },
                    {
                        "type": "link",
                        "content": "App Store Download",
                        "link": "https://apps.apple.com/us/app/skateboard-street/id6446802790"
                    }
                ],
                "imageSrc": "kingpin"
            },
            {
                "id": "ENG",
                "title": "Custom Game Engine [WIP]",
                "date": "January 2024 - Present",
                "description": [
                    {
                        "type": "text",
                        "content": "Building a highly optimized game engine for OSX/Windows/Linux from the ground up with C++ as the base layer. This project is early stage, and part of my game engine architecture class. Eventually, this will be a fully functional 2D engine, with a lua scripting layer."
                    }
                ],
                "imageSrc": "engine"
            },
            {
                "id": "A2G",
                "title": "A2GO",
                "date": "February - March 2023",
                "description": [
                    {
                        "type": "text",
                        "content": "This project is based on the popualar AR mobile game, Pokemon Go, but with reimagined features and mechanics. I worked on this app for 3 weeks with my fellow student, Zachary Behrman. This was such a great learning experience for me as I gained familiarity with Unity's AR features, and mobile targeted development. Made in C# with Unity."
                    }
                ],
                "videoSrc": "https://www.youtube.com/embed/g46pAkalxLo"
            },
            {
                "id": "SAX",
                "title": "Saxophone Simulator",
                "date": "April 2021",
                "description": [
                    {
                        "type": "text",
                        "content": "In just one week, I created a Unity Engine application using C#, where I recorded and mixed all sounds, managed sound functionality and UI interactions, enabling users to play nearly two full octaves on a virtual saxophone. This project was accomplished remotely, collaborating with a partner through GitHub, Zoom, and Google Suite."
                    }
                ],
                "imageSrc": "sax"
            },
            {
                "id": "RUG",
                "title": "Rug Tufting",
                "description": [
                    {
                        "type": "text",
                        "content": "I picked up rug tufting in early 2023 as a way to push myself creatively in the design space. The image above shows the first rug that I designed in blender and photoshop. This has been a great way for me to share my creativity with others as I have introduced and taught many people how to tuft rugs, and gifted a few as well."
                    },
                    {
                        "type": "image",
                        "content": "burtbee"
                    }
                ],
                "imageSrc": "rug"
            }
        ]
    }        
]